In [1]:
import pandas as pd

In [2]:
article_id = pd.read_csv('article-ids.csv')
category_id = pd.read_csv('category-ids.csv')

In [3]:
category_id

        id                                           category
0    C0001                                            subject
1    C0002                                        subject.Art
2    C0003                           subject.Business_Studies
3    C0004                                subject.Citizenship
4    C0005                                  subject.Countries
..     ...                                                ...
141  C0142  subject.Science.Physics.Electricity_and_Electr...
142  C0143            subject.Science.Physics.General_Physics
143  C0144            subject.Science.Physics.Space_Astronomy
144  C0145            subject.Science.Physics.Space_transport
145  C0146                subject.Science.Physics.The_Planets

[146 rows x 2 columns]

In [4]:
path = "wikispeedia_paths-and-graph/"
categories = pd.read_csv(path+'categories.tsv',sep='\t',names=['article','category'])
categories

,article,category
0,%C3%81ed%C3%A1n_mac_Gabr%C3%A1in,subject.History.British_History.British_Histor...
1,%C3%81ed%C3%A1n_mac_Gabr%C3%A1in,subject.People.Historical_figures
2,%C3%85land,subject.Countries
3,%C3%85land,subject.Geography.European_Geography.European_...
4,%C3%89douard_Manet,subject.People.Artists
...,...,...
5199,Zirconium,subject.Science.Chemistry.Chemical_elements
5200,Zoroaster,subject.People.Religious_figures_and_leaders
5201,Zuid-Gelders,subject.Geography.European_Geography
5202,Zuid-Gelders,subject.Language_and_literature.Languages
5203,Zulu,subject.Geography.African_Geography

In [5]:
article = pd.merge(categories, article_id, on='article')

In [6]:
category = pd.merge(article,category_id,on='category')

In [7]:
final =category.sort_values('id_x')

In [8]:
final = (final[['id_x','id_y']]).reset_index(drop=True)

In [9]:
final

       id_x   id_y
0     A0001  C0126
1     A0001  C0098
2     A0002  C0122
3     A0002  C0005
4     A0003  C0092
...     ...    ...
5199  A4601  C0139
5200  A4602  C0107
5201  A4603  C0053
5202  A4603  C0081
5203  A4604  C0049

[5204 rows x 2 columns]

In [10]:
final_dict = dict(zip(final.id_x, final.id_y))

In [11]:
final_dict['A1212']

'C0031'

In [12]:
len(final)

5204

In [13]:
(final.id_x)[0]

'A0001'

In [14]:
new_dict = {}
cnt=0
cnt2=0
for i in range(len(final)):
    name =  'A'+str(cnt+1).zfill(4)
    name2 = 'A'+str(cnt+2).zfill(4)
    if ((final.id_x)[i]==name or (final.id_x)[i]==name2):
        cat = (final.id_y)[i]
        if (final.id_x)[i]==name:
            new_dict[cnt2] = {'Article_ID':name , 'Category_ID':cat}
        else:
            new_dict[cnt2] = {'Article_ID':name2 , 'Category_ID':cat}
            cnt+=1
        cnt2+=1
        
    else:
        print((final.id_x)[i])
        cat = (final.id_y)[i]
        new_dict[cnt2] = {'Article_ID':name2 , 'Category_ID':cat}
        cnt+=1
        cnt2+=1

A1212
A1213
A1214
A1215
A1216
A1233
A1234
A1235
A1236
A1237
A1238
A1239
A1240
A1241
A1242
A1243
A1602
A1603
A1604
A1605
A1606
A1607
A1608
A1609
A1610
A1611
A1612
A1613
A1614
A1615
A1616
A1617
A1618
A3255
A3256
A3851
A3852
A3853
A4547
A4548
A4549
A4550
A4551
A4552
A4553
A4554
A4555
A4556
A4557
A4558
A4559
A4560
A4561
A4562
A4563
A4564

In [15]:
pd.DataFrame.from_dict(new_dict,"index")

     Article_ID Category_ID
0         A0001       C0126
1         A0001       C0098
2         A0002       C0122
3         A0002       C0005
4         A0003       C0092
...         ...         ...
5199      A4601       C0139
5200      A4602       C0107
5201      A4603       C0053
5202      A4603       C0081
5203      A4604       C0049

[5204 rows x 2 columns]

In [16]:
# check